In [9]:
from sklearn.base import BaseEstimator, TransformerMixin

In [53]:
class DataFrameImputer(BaseEstimator, TransformerMixin):
    def __init__(self):
        self.impute_dict={}
        self.feature_name=[]
    
    def fit(self,x,y=None):
        for col in x.columns:
            if x[col].dtype=='O':
                self.impute_dict[col]='missing'
            else:
                self.impute_dict[col]=x[col].mean()
        self.feature_name=x.columns
        return self
    def transform(self,x):
        x=x.fillna(self.impute_dict)
        return x
    def get_feature_names(self):
        return self.feature_names

In [15]:
import numpy as np
import pandas as pd

In [17]:
d = pd.DataFrame({'age':[20,15,np.nan,30,35,40],
                  'city':['delhi',np.nan,'pune', 'delhi','hyderabad','agra']})

In [18]:
d

    age       city
0  20.0      delhi
1  15.0        NaN
2   NaN       pune
3  30.0      delhi
4  35.0  hyderabad
5  40.0       agra

In [54]:
a=DataFrameImputer()

In [35]:
a.impute_dict

{}

In [37]:
a.feature_name

[]

In [55]:
a.fit(d)

DataFrameImputer()

In [56]:
a.impute_dict

{'age': 28.0, 'city': 'missing'}

In [57]:
a.feature_name

Index(['age', 'city'], dtype='object')

In [58]:
a.transform(d)

    age       city
0  20.0      delhi
1  15.0    missing
2  28.0       pune
3  30.0      delhi
4  35.0  hyderabad
5  40.0       agra

In [59]:
d1 = pd.DataFrame({'age':[10,15,np.nan],
                  'city':[np.nan,'delhi','chennai']})

In [60]:
d1

    age     city
0  10.0      NaN
1  15.0    delhi
2   NaN  chennai

In [61]:
a.transform(d1)

    age     city
0  10.0  missing
1  15.0    delhi
2  28.0  chennai

In [62]:
a.feature_name

Index(['age', 'city'], dtype='object')

In [63]:
a.transform(d)

    age       city
0  20.0      delhi
1  15.0    missing
2  28.0       pune
3  30.0      delhi
4  35.0  hyderabad
5  40.0       agra